export const javamts = [
    {
      text: '设计模式',
      collapsible: true,
      collapsed: true,
      items: [
        { text: 'UML图', link: '/010.Java/设计模式/0001.UML图.md' },
        { text: '设计模式概述', link: '/010.Java/设计模式/0002.设计模式概述.md' },
        { text: '开闭原则（软件设计原则）', link: '/010.Java/设计模式/0003.软件设计原则-开闭原则.md' },
        { text: '里氏代换原则（软件设计原则）', link: '/010.Java/设计模式/0004.软件设计原则-里氏代换原则.md' },
        { text: '依赖倒转原则（软件设计原则）', link: '/010.Java/设计模式/0005.软件设计原则-依赖倒转原则.md' },
        { text: '接口隔离原则（软件设计原则）', link: '/010.Java/设计模式/0006.软件设计原则-接口隔离原则.md' },
        { text: '迪米特法则 （软件设计原则）', link: '/010.Java/设计模式/0007.软件设计原则-迪米特法则.md' },
        { text: '合成复用原则（软件设计原则）', link: '/010.Java/设计模式/0008.软件设计原则-合成复用原则.md' },
        { text: '单例模式（创建者模式）', link: '/010.Java/设计模式/0009.创建者模式-单例模式.md' },
        { text: '单例模式扩展（创建者模式）', link: '/010.Java/设计模式/0010.创建者模式-单例模式扩展.md' },
        { text: '工厂模式（创建者模式）', link: '/010.Java/设计模式/0011.创建者模式-工厂模式.md' },
        { text: '原型模式（创建者模式）', link: '/010.Java/设计模式/0012.创建者模式-原型模式.md' },
        { text: '建造者模式（创建者模式）', link: '/010.Java/设计模式/0013.创建者模式-建造者模式.md' },
        { text: '创建者模式对比', link: '/010.Java/设计模式/0014.创建者模式对比.md' },
        { text: '代理模式', link: '/010.Java/设计模式/0015.设计模式-代理模式.md' },
        { text: '适配器模式', link: '/010.Java/设计模式/0016.设计模式-适配器模式.md' },
        { text: '装饰者模式', link: '/010.Java/设计模式/0017.设计模式-装饰者模式.md' },
      ]
    }
  ]